# SQL for Analyst 1 - Basic Commands

In [1]:
# set MySQL URL
user = "dz3vg"
password = ""
host = "localhost"
port = 3306
dbname = "dataapplab_db"
with open("MySQL.key", "r") as file:
    password = file.read()
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

# connect to MySQL server
%load_ext sql
%sql $connection_string

# clean password
password = ""
connection_string = ""

In [2]:
%sql select version(), current_date;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[('8.0.21-0ubuntu0.20.04.4', datetime.date(2020, 8, 14))]

In [3]:
%sql select 5 + 3, sin(pi()/4), (4+1)*5;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(8, 0.7071067811865475, 25)]

In [4]:
%sql show databases;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
7 rows affected.

[('dalba',),
 ('dataapplab_db',),
 ('hr',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [5]:
%sql show tables;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [6]:
%sql drop database if exists dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
4 rows affected.

[]

In [7]:
%sql create database if not exists dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[]

In [8]:
%sql use dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [9]:
%%sql

drop table if exists products;

create table if not exists products (
    primary key (product_id), 
    product_id int(11) not null auto_increment, 
    product_name varchar(100) default null, 
    image_url varchar(255) default null, 
    sales_status enum('NEW','DEPRECATED') default 'NEW', 
    price  decimal(9,2) default null, 
    create_date datetime)
;

describe products;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
6 rows affected.

[('product_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('product_name', b'varchar(100)', 'YES', '', None, ''),
 ('image_url', b'varchar(255)', 'YES', '', None, ''),
 ('sales_status', b"enum('NEW','DEPRECATED')", 'YES', '', b'NEW', ''),
 ('price', b'decimal(9,2)', 'YES', '', None, ''),
 ('create_date', b'datetime', 'YES', '', None, '')]

In [10]:
%%sql

insert into products
values
    (1,'XiangLaJiTuiBaoRenQiCanA','http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg','NEW',36,'2014-11-20 08:20:00'), 
    (2,'HaiTaiYanShaoDaJiTuiFanTaoCanA2','','NEW',37,'2014-12-20 08:20:00'), 
    (3,'XiaRiBinFenTong','','NEW',88,'2016-11-20 10:20:00'), 
    (4,'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB','','NEW',36,'2016-11-20 10:20:00'), 
    (5,'GuoQiTaoCan','','DEPRECATED',999,'2018-11-20 10:20:00')
;

select * from products;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [11]:
%%sql

insert into products
    (product_name,price,create_date)
values
    ('ChaoJiTaKeWuCanTaoCan',27,now())
;

select * from products;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 1, 35, 15))]

In [12]:
%%sql

drop table if exists orders;

create table if not exists orders (
    primary key (order_id),
    order_id int(11) not null auto_increment,
    order_no varchar(100) default null,
    user_name varchar(100) not null,
    product_name varchar(100) not null,
    order_status enum('CART','DRAFT','NEW','IN_PROCESS','COMPLETED','FAILED') default 'CART', 
    create_date datetime not null default current_timestamp comment 'ZhuCeShiJian'
);

describe orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
6 rows affected.

[('order_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('order_no', b'varchar(100)', 'YES', '', None, ''),
 ('user_name', b'varchar(100)', 'NO', '', None, ''),
 ('product_name', b'varchar(100)', 'NO', '', None, ''),
 ('order_status', b"enum('CART','DRAFT','NEW','IN_PROCESS','COMPLETED','FAILED')", 'YES', '', b'CART', ''),
 ('create_date', b'datetime', 'NO', '', b'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED')]

In [13]:
%%sql

alter table orders add column unit_price decimal(9,2) null default 0.0 after product_name;
alter table orders add column quantity int not null default 0 after unit_price;

describe orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
8 rows affected.

[('order_id', b'int', 'NO', 'PRI', None, 'auto_increment'),
 ('order_no', b'varchar(100)', 'YES', '', None, ''),
 ('user_name', b'varchar(100)', 'NO', '', None, ''),
 ('product_name', b'varchar(100)', 'NO', '', None, ''),
 ('unit_price', b'decimal(9,2)', 'YES', '', b'0.00', ''),
 ('quantity', b'int', 'NO', '', b'0', ''),
 ('order_status', b"enum('CART','DRAFT','NEW','IN_PROCESS','COMPLETED','FAILED')", 'YES', '', b'CART', ''),
 ('create_date', b'datetime', 'NO', '', b'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED')]

In [14]:
%%sql

insert into orders
    (order_no,user_name,product_name,unit_price,quantity)
values
    ('KFC123','joshua','XiangLaJiTuiBaoRenQiCanA',36,1), 
    ('KFC321','joshua','HaiTaiYanShaoDaJiTuiFanTaoCanA2',37,2), 
    ('KFC234','jane','XiaRiBinFenTong',88,1), 
    ('KFC567','peize','ChaoZhiQuanJiaTong',85,3), 
    ('KFC890','feng','XinAoErLiangKaoJiTuiBaoRenQiTaoCanB',36,2), 
    ('KFC890','xiaowan','ChaoJiTaKeWuCanTaoCan',29,1)
;

select * from orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.
6 rows affected.

[(1, 'KFC123', 'joshua', 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), 1, 'CART', datetime.datetime(2020, 8, 14, 1, 35, 15)),
 (2, 'KFC321', 'joshua', 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), 2, 'CART', datetime.datetime(2020, 8, 14, 1, 35, 15)),
 (3, 'KFC234', 'jane', 'XiaRiBinFenTong', Decimal('88.00'), 1, 'CART', datetime.datetime(2020, 8, 14, 1, 35, 15)),
 (4, 'KFC567', 'peize', 'ChaoZhiQuanJiaTong', Decimal('85.00'), 3, 'CART', datetime.datetime(2020, 8, 14, 1, 35, 15)),
 (5, 'KFC890', 'feng', 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), 2, 'CART', datetime.datetime(2020, 8, 14, 1, 35, 15)),
 (6, 'KFC890', 'xiaowan', 'ChaoJiTaKeWuCanTaoCan', Decimal('29.00'), 1, 'CART', datetime.datetime(2020, 8, 14, 1, 35, 15))]

In [15]:
%%sql

update orders set create_date = create_date - interval 4 day where order_id = 1;
update orders set create_date = create_date - interval 9 day where order_id = 2;
update orders set create_date = create_date - interval 11 day where order_id = 3;
update orders set create_date = create_date - interval 12 day where order_id = 4;
update orders set create_date = create_date - interval 6 day where order_id = 5;
update orders set create_date = create_date - interval 9 day where order_id = 6;

select * from orders;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.

[(1, 'KFC123', 'joshua', 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), 1, 'CART', datetime.datetime(2020, 8, 10, 1, 35, 15)),
 (2, 'KFC321', 'joshua', 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), 2, 'CART', datetime.datetime(2020, 8, 5, 1, 35, 15)),
 (3, 'KFC234', 'jane', 'XiaRiBinFenTong', Decimal('88.00'), 1, 'CART', datetime.datetime(2020, 8, 3, 1, 35, 15)),
 (4, 'KFC567', 'peize', 'ChaoZhiQuanJiaTong', Decimal('85.00'), 3, 'CART', datetime.datetime(2020, 8, 2, 1, 35, 15)),
 (5, 'KFC890', 'feng', 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), 2, 'CART', datetime.datetime(2020, 8, 8, 1, 35, 15)),
 (6, 'KFC890', 'xiaowan', 'ChaoJiTaKeWuCanTaoCan', Decimal('29.00'), 1, 'CART', datetime.datetime(2020, 8, 5, 1, 35, 15))]

In [16]:
%sql drop database if exists hr;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[]

In [17]:
%sql create database if not exists hr;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[]

In [18]:
%sql use hr;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [19]:
%%sql

drop table if exists employees;

create table if not exists employees (
    employee_id int not null, 
    first_name varchar(45) not null, 
    last_name varchar(45) not null, 
    email varchar(45) not null, 
    phone_number varchar(45) not null, 
    hire_date date, 
    job_id varchar(15) not null, 
    salary int not null, 
    commission_pct decimal(3, 2) not null, 
    manager_id int not null, 
    department_id int not null)
;

describe employees;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
11 rows affected.

[('employee_id', b'int', 'NO', '', None, ''),
 ('first_name', b'varchar(45)', 'NO', '', None, ''),
 ('last_name', b'varchar(45)', 'NO', '', None, ''),
 ('email', b'varchar(45)', 'NO', '', None, ''),
 ('phone_number', b'varchar(45)', 'NO', '', None, ''),
 ('hire_date', b'date', 'YES', '', None, ''),
 ('job_id', b'varchar(15)', 'NO', '', None, ''),
 ('salary', b'int', 'NO', '', None, ''),
 ('commission_pct', b'decimal(3,2)', 'NO', '', None, ''),
 ('manager_id', b'int', 'NO', '', None, ''),
 ('department_id', b'int', 'NO', '', None, '')]

In [20]:
%%sql

drop table if exists countries;

create table if not exists countries (
    country_id varchar(2) not null, 
    country_name varchar(25) not null, 
    region_id int not null)
;

describe countries;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
3 rows affected.

[('country_id', b'varchar(2)', 'NO', '', None, ''),
 ('country_name', b'varchar(25)', 'NO', '', None, ''),
 ('region_id', b'int', 'NO', '', None, '')]

In [21]:
%%sql

drop table if exists departments;

create table if not exists departments (
    department_id int not null, 
    department_name varchar(25) not null, 
    manager_id int not null, 
    location_id int not null)
;

describe departments;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
4 rows affected.

[('department_id', b'int', 'NO', '', None, ''),
 ('department_name', b'varchar(25)', 'NO', '', None, ''),
 ('manager_id', b'int', 'NO', '', None, ''),
 ('location_id', b'int', 'NO', '', None, '')]

In [22]:
%%sql

drop table if exists job_history;

create table if not exists job_history (
    employee_id int not null, 
    start_date date, 
    end_date date, 
    job_id varchar(15) not null, 
    department_id int not null)
;

describe job_history;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
5 rows affected.

[('employee_id', b'int', 'NO', '', None, ''),
 ('start_date', b'date', 'YES', '', None, ''),
 ('end_date', b'date', 'YES', '', None, ''),
 ('job_id', b'varchar(15)', 'NO', '', None, ''),
 ('department_id', b'int', 'NO', '', None, '')]

In [23]:
%%sql

drop table if exists locations;

create table if not exists locations (
    location_id int not null, 
    street_address varchar(35) not null, 
    postal_code varchar(20) not null, 
    city varchar(25) not null, 
    state_province varchar(25) not null, 
    country_id varchar(2) not null)
;

describe locations;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
6 rows affected.

[('location_id', b'int', 'NO', '', None, ''),
 ('street_address', b'varchar(35)', 'NO', '', None, ''),
 ('postal_code', b'varchar(20)', 'NO', '', None, ''),
 ('city', b'varchar(25)', 'NO', '', None, ''),
 ('state_province', b'varchar(25)', 'NO', '', None, ''),
 ('country_id', b'varchar(2)', 'NO', '', None, '')]

In [24]:
%%sql

drop table if exists jobs;

create table if not exists jobs (
    job_id varchar(10) not null, 
    job_title varchar(40) not null, 
    min_salary int not null, 
    max_salary int not null)
;

describe jobs;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
4 rows affected.

[('job_id', b'varchar(10)', 'NO', '', None, ''),
 ('job_title', b'varchar(40)', 'NO', '', None, ''),
 ('min_salary', b'int', 'NO', '', None, ''),
 ('max_salary', b'int', 'NO', '', None, '')]

In [25]:
%sql show tables;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[('countries',),
 ('departments',),
 ('employees',),
 ('job_history',),
 ('jobs',),
 ('locations',)]

In [26]:
%%sql

load data infile "/var/lib/mysql-files/hr/employees.csv"
into table employees
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from employees limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
107 rows affected.
10 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', 24000, Decimal('0.00'), 0, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1987, 6, 18), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1987, 6, 19), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1987, 6, 20), 'IT_PROG', 9000, Decimal('0.00'), 102, 60),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1987, 6, 21), 'IT_PROG', 6000, Decimal('0.00'), 103, 60),
 (105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', datetime.date(1987, 6, 22), 'IT_PROG', 4800, Decimal('0.00'), 103, 60),
 (106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', datetime.date(1987, 6, 23), 'IT_PROG', 4800, Decimal('0.00'), 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1987, 6, 24), 'IT_PROG', 4200, Decimal('0.00'), 103, 60),
 (108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', datetime.date(1987, 6, 25), 'FI_MGR', 12000, Decimal('0.00'), 101, 100),
 (109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', datetime.date(1987, 6, 26), 'FI_ACCOUNT', 9000, Decimal('0.00'), 108, 100)]

In [27]:
%%sql

load data infile "/var/lib/mysql-files/hr/countries.csv"
into table countries
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from countries limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
25 rows affected.
10 rows affected.

[('AR', 'Argentina', 2),
 ('AU', 'Australia', 3),
 ('BE', 'Belgium', 1),
 ('BR', 'Brazil', 2),
 ('CA', 'Canada', 2),
 ('CH', 'Switzerland', 1),
 ('CN', 'China', 3),
 ('DE', 'Germany', 1),
 ('DK', 'Denmark', 1),
 ('EG', 'Egypt', 4)]

In [28]:
%%sql

load data infile "/var/lib/mysql-files/hr/departments.csv"
into table departments
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from departments limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
27 rows affected.
10 rows affected.

[(10, 'Administration', 200, 1700),
 (20, 'Marketing', 201, 1800),
 (30, 'Purchasing', 114, 1700),
 (40, 'Human Resources', 203, 2400),
 (50, 'Shipping', 121, 1500),
 (60, 'IT', 103, 1400),
 (70, 'Public Relations', 204, 2700),
 (80, 'Sales', 145, 2500),
 (90, 'Executive', 100, 1700),
 (100, 'Finance', 108, 1700)]

In [29]:
%%sql

load data infile "/var/lib/mysql-files/hr/job_history.csv"
into table job_history
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from job_history limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.
10 rows affected.

[(102, datetime.date(1993, 1, 13), datetime.date(1998, 7, 24), 'IT_PROG', 60),
 (101, datetime.date(1989, 9, 21), datetime.date(1993, 10, 27), 'AC_ACCOUNT', 110),
 (101, datetime.date(1993, 10, 28), datetime.date(1997, 3, 15), 'AC_MGR', 110),
 (201, datetime.date(1996, 2, 17), datetime.date(1999, 12, 19), 'MK_REP', 20),
 (114, datetime.date(1998, 3, 24), datetime.date(1999, 12, 31), 'ST_CLERK', 50),
 (122, datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'ST_CLERK', 50),
 (200, datetime.date(1987, 9, 17), datetime.date(1993, 6, 17), 'AD_ASST', 90),
 (176, datetime.date(1998, 3, 24), datetime.date(1998, 12, 31), 'SA_REP', 80),
 (176, datetime.date(1999, 1, 1), datetime.date(1999, 12, 31), 'SA_MAN', 80),
 (200, datetime.date(1994, 7, 1), datetime.date(1998, 12, 31), 'AC_ACCOUNT', 90)]

In [30]:
%%sql

load data infile "/var/lib/mysql-files/hr/locations.csv"
into table locations
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from locations limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
23 rows affected.
10 rows affected.

[(1000, '1297 Via Cola di Rie', '989', 'Roma', '', 'IT'),
 (1100, '93091 Calle della Testa', '10934', 'Venice', '', 'IT'),
 (1200, '2017 Shinjuku-ku', '1689', 'Tokyo', 'Tokyo Prefecture', 'JP'),
 (1300, '9450 Kamiya-cho', '6823', 'Hiroshima', '', 'JP'),
 (1400, '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas', 'US'),
 (1500, '2011 Interiors Blvd', '99236', 'South San Francisco', 'California', 'US'),
 (1600, '2007 Zagora St', '50090', 'South Brunswick', 'New Jersey', 'US'),
 (1700, '2004 Charade Rd', '98199', 'Seattle', 'Washington', 'US'),
 (1800, '147 Spadina Ave', 'M5V 2L7', 'Toronto', 'Ontario', 'CA'),
 (1900, '6092 Boxwood St', 'YSW 9T2', 'Whitehorse', 'Yukon', 'CA')]

In [31]:
%%sql

load data infile "/var/lib/mysql-files/hr/jobs.csv"
into table jobs
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from jobs limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
19 rows affected.
10 rows affected.

[('AD_PRES', 'President', 20000, 40000),
 ('AD_VP', 'Administration Vice President', 15000, 30000),
 ('AD_ASST', 'Administration Assistant', 3000, 6000),
 ('FI_MGR', 'Finance Manager', 8200, 16000),
 ('FI_ACCOUNT', 'Accountant', 4200, 9000),
 ('AC_MGR', 'Accounting Manager', 8200, 16000),
 ('AC_ACCOUNT', 'Public Accountant', 4200, 9000),
 ('SA_MAN', 'Sales Manager', 10000, 20000),
 ('SA_REP', 'Sales Representative', 6000, 12000),
 ('PU_MAN', 'Purchasing Manager', 8000, 15000)]

In [32]:
%sql use dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [33]:
%%sql

drop table if exists simple_sales;

create table if not exists simple_sales (
    year int not null, 
    country varchar(10) not null, 
    product varchar(15) not null, 
    profit int not null)
;

describe simple_sales;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
4 rows affected.

[('year', b'int', 'NO', '', None, ''),
 ('country', b'varchar(10)', 'NO', '', None, ''),
 ('product', b'varchar(15)', 'NO', '', None, ''),
 ('profit', b'int', 'NO', '', None, '')]

In [34]:
%%sql

load data infile "/var/lib/mysql-files/dalba/simple_sales.csv"
into table simple_sales
fields terminated by ','
enclosed by '"'
lines terminated by '\n'
ignore 1 rows
;

select * from simple_sales limit 10;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
13 rows affected.
10 rows affected.

[(2000, 'Finland', 'Computer', 1500),
 (2000, 'Finland', 'Phone', 100),
 (2001, 'Finland', 'Phone', 10),
 (2000, 'India', 'Calculator', 75),
 (2000, 'India', 'Calculator', 75),
 (2000, 'India', 'Computer', 1200),
 (2000, 'USA', 'Calculator', 75),
 (2000, 'USA', 'Computer', 1500),
 (2001, 'USA', 'Calculator', 50),
 (2001, 'USA', 'Computer', 1500)]

In [35]:
%%sql

drop table if exists ts;

create table if not exists ts (
    date date, 
    symbol varchar(20), 
    price decimal, 
    volume int)
;

describe ts;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.
0 rows affected.
4 rows affected.

[('date', b'date', 'YES', '', None, ''),
 ('symbol', b'varchar(20)', 'YES', '', None, ''),
 ('price', b'decimal(10,0)', 'YES', '', None, ''),
 ('volume', b'int', 'YES', '', None, '')]

In [36]:
%%sql

insert into ts
values 
    ('2018-01-01','AAPL','10.00', 100),
    ('2018-01-01','AMZN','200.00',100),
    ('2018-01-02','AAPL','20.00',100),
    ('2018-01-02','AMZN','201.00',100),
    ('2018-01-03','AAPL','15.00',100),
    ('2018-01-03','AMZN','202.00',100),
    ('2018-01-04','AAPL','25.00',100),
    ('2018-01-04','AMZN','203.00',100),
    ('2018-01-05','AAPL','15.00',100),
    ('2018-01-05','AMZN','204.00',100),
    ('2018-01-08','AAPL','25.00',100),
    ('2018-01-08','AMZN','207.00',100),
    ('2018-01-09','AAPL','40.00',100),
    ('2018-01-09','AMZN','208.00',100),
    ('2018-01-10','AAPL','45.00',100),
    ('2018-01-10','AMZN','209.00',100),
    ('2018-02-01','AAPL','50.00',100),
    ('2018-02-01','AMZN','210.00',100),
    ('2018-03-01','AAPL','100.00',100),
    ('2018-03-01','AMZN','211.00',100)
;

select * from ts order by symbol, date;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
20 rows affected.
20 rows affected.

[(datetime.date(2018, 1, 1), 'AAPL', Decimal('10'), 100),
 (datetime.date(2018, 1, 2), 'AAPL', Decimal('20'), 100),
 (datetime.date(2018, 1, 3), 'AAPL', Decimal('15'), 100),
 (datetime.date(2018, 1, 4), 'AAPL', Decimal('25'), 100),
 (datetime.date(2018, 1, 5), 'AAPL', Decimal('15'), 100),
 (datetime.date(2018, 1, 8), 'AAPL', Decimal('25'), 100),
 (datetime.date(2018, 1, 9), 'AAPL', Decimal('40'), 100),
 (datetime.date(2018, 1, 10), 'AAPL', Decimal('45'), 100),
 (datetime.date(2018, 2, 1), 'AAPL', Decimal('50'), 100),
 (datetime.date(2018, 3, 1), 'AAPL', Decimal('100'), 100),
 (datetime.date(2018, 1, 1), 'AMZN', Decimal('200'), 100),
 (datetime.date(2018, 1, 2), 'AMZN', Decimal('201'), 100),
 (datetime.date(2018, 1, 3), 'AMZN', Decimal('202'), 100),
 (datetime.date(2018, 1, 4), 'AMZN', Decimal('203'), 100),
 (datetime.date(2018, 1, 5), 'AMZN', Decimal('204'), 100),
 (datetime.date(2018, 1, 8), 'AMZN', Decimal('207'), 100),
 (datetime.date(2018, 1, 9), 'AMZN', Decimal('208'), 100),
 (datetime.date(2018, 1, 10), 'AMZN', Decimal('209'), 100),
 (datetime.date(2018, 2, 1), 'AMZN', Decimal('210'), 100),
 (datetime.date(2018, 3, 1), 'AMZN', Decimal('211'), 100)]

In [37]:
%sql show tables;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
4 rows affected.

[('orders',), ('products',), ('simple_sales',), ('ts',)]